# case_study: Salaries EDA

In [6]:
import pandas as pd

In [ ]:
df=pd.read_csv('Desktop/Salaries1.csv')

In [8]:
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [ ]:
df['BasePay','OvertimePay','OtherPay','Benefits']=df['BasePay','OvertimePay','OtherPay','Benefits'].apply(pd['BasePay','OvertimePay','OtherPay','Benefits'].to_numeric,errors ='coerce').fillna(0)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  float64
 2   JobTitle          148654 non-null  float64
 3   BasePay           148654 non-null  float64
 4   OvertimePay       148654 non-null  float64
 5   OtherPay          148654 non-null  float64
 6   Benefits          148654 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             148654 non-null  float64
 11  Agency            148654 non-null  float64
 12  Status            148654 non-null  float64
dtypes: float64(11), int64(2)
memory usage: 14.7 MB

In [25]:
df[['EmployeeName','JobTitle','Agency']]=df[['EmployeeName','JobTitle','Agency']].astype('object')

In [28]:
df['Year']=df['Year'].astype('int64')

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148654 non-null  float64
 4   OvertimePay       148654 non-null  float64
 5   OtherPay          148654 non-null  float64
 6   Benefits          148654 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             148654 non-null  float64
 11  Agency            148654 non-null  object
 12  Status            148654 non-null  float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [30]:
df.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
count,148654.000000,148654.000000,148654.000000,148654.000000,148654.000000,148654.000000,148654.000000,148654.000000,148654.0,148654.0
mean,74327.500000,66053.729288,5065.923568,3648.669115,18924.232839,74768.321972,93692.554811,2012.522643,0.0,0.0
std,42912.857795,42886.711158,11454.256594,8056.515703,17165.279495,50517.005274,62793.533483,1.117538,0.0,0.0
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,0.0,0.0
25%,37164.250000,32792.545000,0.000000,0.000000,0.000000,36168.995000,44065.650000,2012.000000,0.0,0.0
50%,74327.500000,64861.600000,0.000000,811.170000,23214.020000,71426.610000,92404.090000,2013.000000,0.0,0.0
75%,111490.750000,94605.740000,4657.632500,4235.907500,33468.980000,105839.135000,132876.450000,2014.000000,0.0,0.0
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,0.0,0.0

###   what is the avg BasePay ?

In [34]:
df['BasePay'].mean()

66053.72928809702

### What is the highest amount of OvertimePay in the dataset?

In [33]:
df['OvertimePay'].max()

245131.88

### What is the job title of JOSEPH DRISCOLL EmployeeName? 
Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll).

In [41]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

Series([], Name: JobTitle, dtype: object)

### How much does JOSEPH DRISCOLL make (including benefits)?

In [47]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

Empty DataFrame
Columns: [Id, EmployeeName, JobTitle, BasePay, OvertimePay, OtherPay, Benefits, TotalPay, TotalPayBenefits, Year, Notes, Agency, Status]
Index: []

### What is the name of highest paid person (including benefits)?

In [44]:
 df[df[ 'TotalPayBenefits'] == df[ 'TotalPayBenefits'].max()]['EmployeeName']

0    0.0
Name: EmployeeName, dtype: object

### What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?

In [46]:
 df[df[ 'TotalPayBenefits'] == df['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,0.0,0.0,0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,0.0,0.0,0.0

### What was the average (mean) of all employees per year? (2011-2014) ?

In [48]:
df.groupby( 'Year').mean()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Notes,Status
Year,,,,,,,,,
2011,18080.0,63595.956517,4531.065429,3617.081926,0.000000,71744.103871,71744.103871,0.0,0.0
2012,54542.5,65436.406857,5023.417824,3653.437583,26439.966967,74113.262265,100553.229232,0.0,0.0
2013,91728.5,68509.832156,5281.641980,3819.969007,23829.076572,77611.443142,101440.519714,0.0,0.0
2014,129593.0,66557.437750,5401.426941,3505.053449,24787.000743,75463.918140,100250.918884,0.0,0.0

### What was the average (mean) TotalPayBenefits of all employees per year? (2011-2014) ?

In [54]:
df.groupby('Year').mean()['TotalPayBenefits']

Year
2011     71744.103871
2012    100553.229232
2013    101440.519714
2014    100250.918884
Name: TotalPayBenefits, dtype: float64

### What was the average (mean) BasePay of all employees per year? (2011-2014) ?

In [55]:
df.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    68509.832156
2014    66557.437750
Name: BasePay, dtype: float64

### how many unique job titels are there

In [59]:
df["JobTitle"].unique()

array([0.0], dtype=object)

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148654 non-null  float64
 4   OvertimePay       148654 non-null  float64
 5   OtherPay          148654 non-null  float64
 6   Benefits          148654 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             148654 non-null  float64
 11  Agency            148654 non-null  object
 12  Status            148654 non-null  float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

###  What are the top 5 most common jobs?

In [60]:
df['JobTitle'].value_counts().head (5)

0.0    148654
Name: JobTitle, dtype: int64

### How many people have the word Chief in their job title? (This is pretty tricky)

In [ ]:
def chief(string):

if 'chief' in (string.lower()):

return True

else:

return False

In [ ]:
(df['JobTitle'].apply(lambda x: chief(x))).sum()

### is there a correlation between length of the Job Title string and Salary?

In [ ]:
 df['ntitles']= df['JobTitle'].apply(len)

In [ ]:
df['ntitles']